Autodesk.Revit.DB.Structure.FabricReinSpanSymbol.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.LinkElementId,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.ElementId)
Places a new instance of the Structural Fabric Reinforcement Symbol into the project relative to a particular FabricSheet and View.
document:
The document.
viewId:
The id of the view in which the symbol should appear.
hostId:
The ElementId of FabricSheet (either in the document, or linked from another document).
point:
The span symbol's head position.
symbolId:
The id of the family symbol of this symbol.
Returns:
A reference to the newly-created symbol.
Throws Autodesk.Revit.Exceptions.ArgumentException:
hostId should refer to a FabricSheet element.
-or-
viewId does not refer to a valid view type for FabricReinSpanSymbol - only floor plan, reflected ceiling plans and elevations are permitted.
-or-
symbolId should refer to a FamilySymbol of category OST_FabricReinSpanSymbol.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013